# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Thu Nov 27 12:54:01 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design accelerator

create_clock -name "clk" -period 4.0 -waveform {0.0 2.0} [get_ports clk]
set_clock_transition 0.01 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports start]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxA[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxA[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxA[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxA[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxA[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxA[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxA[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxA[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxA[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxA[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxB[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxB[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxB[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxB[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxB[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxB[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxB[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxB[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxB[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {addr_mtxB[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {rd2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports all_full]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports all_empty]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports done]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad1[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad1[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad1[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad1[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad1[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad1[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad1[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad1[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad2[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad2[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad2[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad2[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad2[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad2[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad2[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad2[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {ad2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C00[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C01[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C02[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C03[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C04[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C05[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C06[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C07[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C10[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C11[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C12[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C13[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C14[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C15[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C16[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C17[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C20[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C21[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C22[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C23[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C24[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C25[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C26[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C27[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C30[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C31[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C32[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C33[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C34[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C35[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C36[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C37[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C40[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C41[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C42[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C43[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C44[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C45[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C46[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C47[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C50[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C51[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C52[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C53[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C54[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C55[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C56[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C57[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C60[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C61[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C62[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C63[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C64[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C65[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C66[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C67[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C70[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C71[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C72[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C73[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C74[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C75[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C76[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.01 [get_ports {C77[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.01 [get_ports clk]
set_clock_uncertainty -hold 0.01 [get_ports clk]
